
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        9 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                       |
|:--------:|:------------------------------------------------------------------------------------------------|
|    🟢    | `module.infrahouse-github-backup.aws_iam_policy.infrahouse-backup`                              |
|    🟢    | `module.infrahouse-github-backup.aws_iam_role.infrahouse-backup`                                |
|    🟢    | `module.infrahouse-github-backup.aws_iam_role_policy_attachment.infrahouse-backup`              |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket.infrahouse-backup`                               |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_policy.infrahouse-backup-bucket`                 |
|    🟢    | `module.infrahouse-github-backup.aws_s3_bucket_public_access_block.public_access`               |
|    🟢    | `module.infrahouse-github-backup.aws_s3_object.check_file`                                      |
|    🟢    | `module.infrahouse-github-backup.github_actions_organization_variable.infrahouse-backup-bucket` |
|    🟢    | `module.infrahouse-github-backup.github_actions_organization_variable.infrahouse-backup-role`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrahouse-github-backup.data.aws_iam_policy_document.infrahouse-backup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "infrahouse-backup" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrahouse-github-backup.data.aws_iam_policy_document.infrahouse-backup-bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "infrahouse-backup-bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.infrahouse-github-backup.data.aws_iam_policy_document.permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrahouse-github-backup.data.aws_iam_policy_document.trust will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "trust" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrahouse-github-backup.aws_iam_policy.infrahouse-backup will be created
  + resource "aws_iam_policy" "infrahouse-backup" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "infrahouse-backup-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse8/github-control"
        }
    }

  # module.infrahouse-github-backup.aws_iam_role.infrahouse-backup will be created
  + resource "aws_iam_role" "infrahouse-backup" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for InfraHouse to backup GitHub"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-backup-"
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse8/github-control"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrahouse-github-backup.aws_iam_role_policy_attachment.infrahouse-backup will be created
  + resource "aws_iam_role_policy_attachment" "infrahouse-backup" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.infrahouse-github-backup.aws_s3_bucket.infrahouse-backup will be created
  + resource "aws_s3_bucket" "infrahouse-backup" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-backup-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by" = "infrahouse8/github-control"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.infrahouse-github-backup.aws_s3_bucket_policy.infrahouse-backup-bucket will be created
  + resource "aws_s3_bucket_policy" "infrahouse-backup-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrahouse-github-backup.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.infrahouse-github-backup.aws_s3_object.check_file will be created
  + resource "aws_s3_object" "check_file" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = ".github"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "created_by" = "infrahouse8/github-control"
        }
      + version_id             = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.infrahouse-github-backup.github_actions_organization_variable.infrahouse-backup-bucket will be created
  + resource "github_actions_organization_variable" "infrahouse-backup-bucket" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "INFRAHOUSE_BACKUP_BUCKET"
      + visibility    = "private"
    }

  # module.infrahouse-github-backup.github_actions_organization_variable.infrahouse-backup-role will be created
  + resource "github_actions_organization_variable" "infrahouse-backup-role" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "INFRAHOUSE_BACKUP_ROLE"
      + visibility    = "private"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogOSwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>